app/Models/actividadModel.php

    public function getAllActividades() {

        $db = \Config\Database::connect('BDReservalo2');
        $builder = $db->table('actividad');

        $builder->select('actividad.*, leyenda_actividad.color');
        $builder->join('tipo_actividad', 'tipo_actividad.id_tipo_actividad = actividad.tipo');
        $builder->join('leyenda_actividad', 'leyenda_actividad.id_leyenda_actividad = tipo_actividad.tipo_reserva');
        $builder->orderBy('fecha', 'DESC');

        return $builder->get()->getResultArray();
---
SELECT `actividad`.*, `leyenda_actividad`.`color`
FROM `actividad`
JOIN `tipo_actividad` ON `tipo_actividad`.`id_tipo_actividad` = `actividad`.`tipo`
JOIN `leyenda_actividad` ON `leyenda_actividad`.`id_leyenda_actividad` = `tipo_actividad`.`tipo_reserva`
ORDER BY `fecha` DESC