app/Models/categoriasModel.php

SELECT `categorias`.*
FROM `categorias`
JOIN `instalaciones` `i1` ON `i1`.`categoria_principal` = `categorias`.`id_categoria`
JOIN `instalaciones` `i2` ON `i2`.`categoria_opcional1` = `categorias`.`id_categoria`
---
    public function getFullCategorias() {

        $db = \Config\Database::connect('BDReservalo2');
        $builder = $db->table('categorias');

        $builder->select('categorias.*, COUNT(DISTINCT i1.id_instalacion) AS instalaciones_principal, COUNT(DISTINCT i2.id_instalacion) AS instalaciones_secundaria, COUNT(DISTINCT i1.id_instalacion) + COUNT(DISTINCT i2.id_instalacion) AS total_instalaciones');
        $builder->join('instalaciones i1', 'i1.categoria_principal = categorias.id_categoria', 'left');
        $builder->join('instalaciones i2', 'i2.categoria_opcional1 = categorias.id_categoria', 'left');
        $builder->groupBy('categorias.id_categoria');

        $query = $builder->get();