app/Models/horariosModel.php

    public function comprobarHorarios(int $instalacion){

        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla de horarios
        $builder = $db->table('tipo_horario');

        // Creamos el horario
        $query = $builder->distinct()
        ->select('tipo_horario.*')
        ->join(
            'franjas_horarias',
            'franjas_horarias.id_tipo_horario = tipo_horario.id_tipo_horario',
            'inner'
        )
        ->where('franjas_horarias.id_instalacion', $instalacion)
        ->get();

        return $query->getResultArray();
---
SELECT DISTINCT `tipo_horario`.*
FROM `tipo_horario`
INNER JOIN `franjas_horarias` ON `franjas_horarias`.`id_tipo_horario` = `tipo_horario`.`id_tipo_horario`
WHERE `franjas_horarias`.`id_instalacion` = 42
SELECT *
FROM `tipo_horario`

    public function hayExcepcionBase(int $id_horario)
    {

        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla de excepciones_horario
        $builder = $db->table('excepciones_horario');

        // Hago el select con join
        $query = $builder->distinct()->select('tipo_horario.nombre, excepciones_horario.id_tipo_horario_excepcion')
            ->join('tipo_horario', 'tipo_horario.id_tipo_horario = excepciones_horario.id_tipo_horario_excepcion')
            ->where('excepciones_horario.id_tipo_horario_base', $id_horario)
            ->get();

        $result = $query->getResultArray();
---
SELECT `excepciones_horario`.*, `tipo_horario`.`nombre`, `tipo_horario`.`color`
FROM `excepciones_horario`
JOIN `tipo_horario` ON `excepciones_horario`.`id_tipo_horario_excepcion` = `tipo_horario`.`id_tipo_horario`

    public function comprobarExcepciones(int $instalacion){

        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla de horarios
        $builder = $db->table('excepciones_horario');

        $builder = $db->table('excepciones_horario');
        $builder->select('excepciones_horario.*, tipo_horario.nombre, tipo_horario.color');
        $builder->join('tipo_horario', 'excepciones_horario.id_tipo_horario_excepcion = tipo_horario.id_tipo_horario');
        $builder->join('franjas_horarias', 'excepciones_horario.id_tipo_horario_excepcion = franjas_horarias.id_tipo_horario');
        $query = $builder->where('franjas_horarias.id_instalacion', $instalacion)
        ->get();
---
SELECT `excepciones_horario`.*, `tipo_horario`.`nombre`, `tipo_horario`.`color`
FROM `excepciones_horario`
JOIN `tipo_horario` ON `excepciones_horario`.`id_tipo_horario_excepcion` = `tipo_horario`.`id_tipo_horario`
JOIN `franjas_horarias` ON `excepciones_horario`.`id_tipo_horario_excepcion` = `franjas_horarias`.`id_tipo_horario`
WHERE `franjas_horarias`.`id_instalacion` = 42