app/Models/horariosModel.php

SELECT *
FROM `tipo_horario`
WHERE `id_tipo_horario` = 8
---
    public function getHorario(int $id_horario){

        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla de horarios
        $builder = $db->table('tipo_horario');

        // Creamos el horario
        $query = $builder->select()->where('id_tipo_horario', $id_horario)->get();

SELECT `franjas_horarias`.`id_franja_horaria`, `franjas_horarias`.`id_tipo_horario`, `franjas_horarias`.`id_instalacion`, `franjas_horarias`.`hora_inicio_manana`, `franjas_horarias`.`hora_fin_manana`, `franjas_horarias`.`hora_inicio_tarde`, `franjas_horarias`.`hora_fin_tarde`, `franjas_horarias`.`franja_unica`, `franjas_dias`.`id_dia_semana`
FROM `franjas_dias`
JOIN `franjas_horarias` ON `franjas_dias`.`id_franja_horaria` = `franjas_horarias`.`id_franja_horaria`
WHERE `id_tipo_horario` = 8
---
    public function getFranjaByIdHorario(int $id_horario){

        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla de horarios
        $builder = $db->table('franjas_dias');

        // Creamos el horario
        $query = $builder->select('franjas_horarias.id_franja_horaria,
                                   franjas_horarias.id_tipo_horario,
                                   franjas_horarias.id_instalacion,
                                   franjas_horarias.hora_inicio_manana,
                                   franjas_horarias.hora_fin_manana,
                                   franjas_horarias.hora_inicio_tarde,
                                   franjas_horarias.hora_fin_tarde,
                                   franjas_horarias.franja_unica,
                                   franjas_dias.id_dia_semana')
                         ->join('franjas_horarias', 'franjas_dias.id_franja_horaria = franjas_horarias.id_franja_horaria')
                         ->where('id_tipo_horario', $id_horario)
                         ->get();