app/Models/instalacionesModel.php

    public function getInstalaciones(?array $filter)
    {

        $db = \Config\Database::connect('BDReservalo2');
        //Obtenemos la tabla en la que vamos a buscar a los usuarios
        $builder = $db->table('instalaciones');
        //Realizamos la consulta
        $query = $builder->select('instalaciones.*,
                                categorias1.nombre as categoria_name,
                                categorias2.nombre as categoria_opc_name,
                                (SELECT imagen1 FROM pistas
                                WHERE pistas.id_instalacion = instalaciones.id_instalacion
                                ORDER BY id_pista ASC LIMIT 1) as imagen1')
            ->join('categorias as categorias1', 'instalaciones.categoria_principal = categorias1.id_categoria', 'left')
            ->join('categorias as categorias2', 'instalaciones.categoria_opcional1 = categorias2.id_categoria', 'left');
            if($filter !== null)
            {
                $whereSentence = "";
                foreach($filter as $campo => $valor)
                {
                    $query->where("instalaciones.".$campo, $valor);
                }
            }
        $result = $query->get()->getResultArray();
---
SELECT `instalaciones`.*, `categorias1`.`nombre` as `categoria_name`, `categorias2`.`nombre` as `categoria_opc_name`
FROM `instalaciones`
LEFT JOIN `categorias` as `categorias1` ON `instalaciones`.`categoria_principal` = `categorias1`.`id_categoria`
LEFT JOIN `categorias` as `categorias2` ON `instalaciones`.`categoria_opcional1` = `categorias2`.`id_categoria`
SELECT *
FROM `categorias`

    public function getCategorias()
    {
        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla en la que vamos a buscar a los usuarios
        $builder = $db->table('categorias');

        $query = $builder->select()->get();
---
SELECT *
FROM `categorias`

    public function getInstalacion(int $id)
    {
        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla en la que vamos a buscar a los usuarios
        $builder = $db->table('instalaciones');

        $query = $builder->select('instalaciones.*, categorias1.nombre as categoria_name, categorias2.nombre as categoria_opc_name')
        ->join('categorias as categorias1', 'instalaciones.categoria_principal = categorias1.id_categoria', 'left')
        ->join('categorias as categorias2', 'instalaciones.categoria_opcional1 = categorias2.id_categoria', 'left')
        ->where('id_instalacion', $id)
        ->get();

        $result = $query->getResultArray();
---
SELECT `instalaciones`.*, `categorias1`.`nombre` as `categoria_name`, `categorias2`.`nombre` as `categoria_opc_name`
FROM `instalaciones`
LEFT JOIN `categorias` as `categorias1` ON `instalaciones`.`categoria_principal` = `categorias1`.`id_categoria`
LEFT JOIN `categorias` as `categorias2` ON `instalaciones`.`categoria_opcional1` = `categorias2`.`id_categoria`
WHERE `id_instalacion` = 42

    public function getPistasByInstalacion(int $id_instalacion)
    {
        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla en la que vamos a buscar a los usuarios
        $builder = $db->table('pistas');

        $query = $builder->select()->where('id_instalacion', $id_instalacion)->get();
---
SELECT *
FROM `pistas`
WHERE `id_instalacion` = 42

    public function getPistasById(int $id_pista)
    {
        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla en la que vamos a buscar a los usuarios
        $builder = $db->table('pistas');

        $query = $builder->select()->where('id_pista', $id_pista)->get();

        $result = $query->getResultArray();
---
SELECT *
FROM `pistas`
WHERE `id_pista` = 101

    public function getNumInstalaciones() {

        // Conexión a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        // Seleccionamos la tabla
        $builder = $db->table('instalaciones');

        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `instalaciones`

    public function getInstalacionesCategorias()
    {
        // Conexión a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        // Seleccionamos la tabla
        $builder = $db->table('categorias');

        $query = $builder->select('categorias.nombre, COUNT(instalaciones.id_instalacion) AS num_instalaciones')
                         ->join('instalaciones', 'categorias.id_categoria = instalaciones.categoria_principal', 'left')
                         ->groupBy('categorias.nombre')
                         ->orderBy('num_instalaciones', 'DESC')
                         ->limit(3)
                         ->get();

        $result = $query->getResultArray();
---
SELECT `categorias`.`nombre`, COUNT(instalaciones.id_instalacion) AS num_instalaciones
FROM `categorias`
LEFT JOIN `instalaciones` ON `categorias`.`id_categoria` = `instalaciones`.`categoria_principal`
GROUP BY `categorias`.`nombre`
ORDER BY `num_instalaciones` DESC
 LIMIT 3