app/Models/instalacionesModel.php

    public function getPistasById(int $id_pista)
    {
        // Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        // Tabla principal
        $builder = $db->table('pistas');

        $subquery = $this->db->table('reservas')
            ->select('
                id_pista,
                MIN(CASE WHEN DATE(fecha) >= CURDATE() THEN fecha END) as proxima_reserva,
                COUNT(id_reserva) as reservas
            ')
            ->groupBy('id_pista');

        $query = $builder
            ->select('pistas.*, instalaciones.estado, r.proxima_reserva, r.reservas')
            ->join('instalaciones', 'instalaciones.id_instalacion = pistas.id_instalacion', 'inner')
            ->join("({$subquery->getCompiledSelect()}) r", 'r.id_pista = pistas.id_pista', 'left')
            ->where('pistas.id_pista', $id_pista)
            ->get();
---
SELECT `pistas`.*, `instalaciones`.`estado`
FROM `pistas`
INNER JOIN `instalaciones` ON `instalaciones`.`id_instalacion` = `pistas`.`id_instalacion`
WHERE `pistas`.`id_pista` = 92

    public function getNumInstalaciones() {

        // Conexión a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        // Seleccionamos la tabla
        $builder = $db->table('instalaciones');

        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `instalaciones`