app/Models/loginModel.php

SELECT `email`
FROM `usuarios`
---
    public function existeEmail(string $email)
    {
        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla en la que vamos a buscar a los usuarios
        $builder = $db->table('usuarios');

        // Realizamos la sentencia
        $builder->select('email');

        // Obtenemos los resultados
        $query  = $builder->get();

SELECT `id_usuario`
FROM `usuarios`
WHERE `email` = 'danielruizdeveloper@gmail.com'
---
    public function buscarIdporEmail (string $email)
    {
        //Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla en la que vamos a buscar a los usuarios
        $builder = $db->table('usuarios');

        // Realizamos la sentencia
        $builder->select("id_usuario")->where("email", $email);

        // Obtenemos los resultados
        $query  = $builder->get();

UPDATE `usuarios` SET `token` = 'adc3fb29d5129292c4a37e624546ebcb89a1e03782a27f930590cd1f410aaca9766831f38ca1991060c19469b527d9e95fd5', `token_date` = '2025-06-11 15:53:53'
WHERE `id_usuario` = 5
---
    public function anadirToken (array $data, int $id_usuario)
    {
        //Conexion a la base de datos
        $db     = \Config\Database::connect('BDReservalo2');

        //Obtenemos la tabla en la que vamos a buscar a los usuarios
        $builder = $db->table('usuarios');

        //Actualizamos los campos token y date_token con los valores creados
        $builder->where("id_usuario", $id_usuario)->update($data);