app/Models/reservasModel.php

INSERT INTO `reservas` (`id_pista`, `fecha`, `hora_inicio`, `hora_final`, `fecha_reserva`, `id_usuario`, `id_pedido`) VALUES ('101', '2026-02-16', '00:00:00', '23:59:59', '2026-02-09 19:13:28', '5', 58)
---
    public function hacerReserva(array $data)
    {

        // Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        // Obtenemos la tabla en la que vamos a buscar las reservas
        $builder = $db->table('reservas');

        // Hacemos la sentencia
        $builder->insert($data);

SELECT *
FROM `reservas`
WHERE `id_pista` = 89
AND `fecha` = '2026-01-27'
---
    public function reservasById(int $id_pista, string $fecha)
    {

        // Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        // Obtenemos la tabla en la que vamos a buscar las reservas
        $builder = $db->table('reservas');

        $builder->select();
        $builder->where("id_pista", $id_pista);
        $builder->where("fecha", $fecha);

        $query = $builder->get();

INSERT INTO `pedido` (`id_usuario`, `fecha_pedido`, `precio_pedido`, `num_pedido`) VALUES ('5', '2026-02-09 19:13:28', '0', '20260209-191328-001')
---
    public function hacerPedido(array $data)
    {

        // Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        // Obtenemos la tabla en la que vamos a buscar las reservas
        $builder = $db->table('pedido');

        // Hacemos la sentencia
        $builder->insert($data);

SELECT *
FROM `pedido`
WHERE `fecha_pedido` = '2026-02-09 19:13:28'
---
    public function pedidosFromDate(string $date)
    {

        // Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        // Obtenemos la tabla en la que vamos a buscar las reservas
        $builder = $db->table('pedido');

        $builder->select();
        $builder->where('fecha_pedido', $date);

        $query = $builder->get();

DELETE FROM `pedido`
WHERE `id_pedido` = 58
---
    public function anularPedido(int $id_pedido)
    {

        // Conexión a la BD
        $db = \Config\Database::connect('BDReservalo2');

        // Construcción de la query para anular el pedido
        $builder = $db->table('pedido');

        $builder->where('id_pedido', $id_pedido);

        return $builder->delete();

DELETE FROM `reservas`
WHERE `id_pedido` = 58
---
    public function anularReservasByPedido(int $id_pedido)
    {

        // Conexión a la BD
        $db = \Config\Database::connect('BDReservalo2');

        // Construcción de la query para anular la reserva
        $builder = $db->table('reservas');

        $builder->where('id_pedido', $id_pedido);

        return $builder->delete();