app/Models/usuariosModel.php

SELECT `usuarios`.*, SUM(CASE 
            WHEN reservas.pagadas = 0
            AND reservas.fecha < '2026-03-18'
            THEN 1
            ELSE 0
        END) AS reservas_pasadas
FROM `usuarios`
LEFT JOIN `reservas` ON `reservas`.`id_usuario` = `usuarios`.`id_usuario`
GROUP BY `usuarios`.`id_usuario`
---
    public function getUsuarios()
    {

        // Conexion a la base de datos
        $db = \Config\Database::connect('BDReservalo2');

        // Obtenemos la tabla principal
        $builder = $db->table('usuarios');

        // Select con los campos y agregaciones
        $builder->select("
        usuarios.*,
        SUM(CASE
            WHEN reservas.pagadas = 0
            AND reservas.fecha < '" . date("Y-m-d") . "'
            THEN 1
            ELSE 0
        END) AS reservas_pasadas
        ");

        // LEFT JOIN
        $builder->join(
            'reservas',
            'reservas.id_usuario = usuarios.id_usuario',
            'left'
        );

        // GROUP BY
        $builder->groupBy('usuarios.id_usuario');

        return $builder->get()->getResultArray();